
INSERT INTO AUTHORS (ID, NAME) VALUES
  (10, 'Курт Воннегут'),
  (11, 'Джек Лондон'),
  (12, 'Стивен Кинг'),
  (13, 'Лев Толстой'),
  (14, 'Брюс Эккель'),
  (15, 'Эрнест Хеммингуэй');

INSERT INTO GENRES (ID, NAME) VALUES
  (10, 'Фантастика'),
  (11, 'Приключения'),
  (12, 'Хоррор'),
  (13, 'Проза'),
  (14, 'Программирование');

INSERT INTO BOOKS (ID, TITLE) VALUES
  (10, 'Бойня номер пять, или Крестовый поход детей'),
  (11, 'Белый клык'),
  (12, 'Оно'),
  (13, 'Война и мир'),
  (14, 'Философия Java'),
  (15, 'Праздник, который всегда с тобой');

INSERT INTO BOOKS_AUTHORS (BOOK_ID, AUTHOR_ID) VALUES
  (10, 10),
  (11, 11),
  (12, 12),
  (13, 13),
  (14, 14),
  (15, 15);

INSERT INTO BOOKS_GENRES (BOOK_ID, GENRE_ID) VALUES
  (10, 10),
  (11, 11),
  (11, 13),
  (12, 10),
  (12, 12),
  (13, 13),
  (14, 14),
  (15, 13);
